Revit 2026 API

# DeleteWorksetSettings(DeleteWorksetOption, WorksetId) Constructor

---

Constructs a DeleteWorksetSettings object.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public DeleteWorksetSettings(
	DeleteWorksetOption deleteWorksetOption,
	WorksetId elementsMoveInto
)
```
```vb
Public Sub New (
	deleteWorksetOption As DeleteWorksetOption,
	elementsMoveInto As WorksetId
)
```
```cpp
public:
DeleteWorksetSettings(
	DeleteWorksetOption deleteWorksetOption,
	WorksetId^ elementsMoveInto
)
```
```fsharp
new :
        deleteWorksetOption : DeleteWorksetOption *
        elementsMoveInto : WorksetId -> DeleteWorksetSettings
```

#### Parameters

deleteWorksetOption DeleteWorksetOption

elementsMoveInto WorksetId

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |
| ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

elementsMoveInto only takes effect when DeleteWorksetOption::Enum is MoveElementsToWorkset.

#### Reference

DeleteWorksetSettings Class

DeleteWorksetSettings Overload

Autodesk.Revit.DB Namespace